      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  VAR1 PIC XX VALUE SPACES.
      *                      =" "
       01  VAR2 PIC 99 VALUE ZERO.
       01  VAR3 PIC 99 VALUE ZEROS.
       01  VAR4 PIC 99 VALUE ZEROES.
      *                      =00

       PROCEDURE DIVISION.
           DISPLAY VAR1.
           DISPLAY VAR2.
           DISPLAY VAR3.
           DISPLAY VAR4.
           STOP RUN.
       END PROGRAM PROGRAM-NAME.
