      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
      *    Constante e um valor que nunca muda
           DISPLAY 'Este texto vai ser mostrado'.
           STOP RUN.
       END PROGRAM PROGRAM-NAME.
