      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
      * Nivel Nome PIC Tipo VALUE Valor.
       01  SALUDO PIC X(4) Value 'Hello'.
       
       PROCEDURE DIVISION.
           DISPLAY SALUDO.
           STOP RUN.
       END PROGRAM PROGRAM-NAME.