      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-NAME.

       DATA DIVISION.
      * Nome de todos os arquivos que o programa utiliza
       FILE SECTION.
      * Declarar variaveis do programa ^ ?
       WORKING-STORAGE SECTION.
      * Registra as variaveis do programa principal ^ ?
       LINKAGE SECTION.
      
       PROCEDURE DIVISION.
           DISPLAY 'Hello, world!'.
           STOP RUN.
       END PROGRAM PROGRAM-NAME.