      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
      * Divizão obrigatória
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-NAME.
       AUTHOR. Eliton

      * Especificar aonde esta instalado o programa ^ MainFrame
       INSTALLATION. www.

      * Data de quando foi criado o programa
       DATE-WRITTEN. 26/10/2020

      * Data de compilação do programa
       DATE-COMPILED. 26/10/2020
       REMARKS. Descrição do programa

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY 'Hello, world!'.
           STOP RUN.
       END PROGRAM PROGRAM-NAME.