      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  vDOUBLE PIC 99V99.
       01  vNEGATIVE PIC S9999.
      
       PROCEDURE DIVISION.
           MOVE 10.15 TO vDOUBLE.
           MOVE 1015 TO vNEGATIVE.



           STOP RUN.
       END PROGRAM PROGRAM-NAME.