      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-NAME.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  VARIABLE-COMPUESTA.
           02  NUM1 PIC 9 VALUE 12.
           02  NUM2 PIC 9 VALUE 37.

       PROCEDURE DIVISION.
           DISPLAY 'Hello, World!'.
           STOP RUN.
       END PROGRAM PROGRAM-NAME.
