       FD  EMPEADOS-ARCHIVO.
           01  EMPEADOS-REGISTRO.
               05  EMPEADOS-ID PIC 9(6).
               05  EMPEADOS-NOMBRE PIC X(25).
               05  EMPEADOS-APELLIDOS PIC X(35).
               05  EMPEADOS-EDAD PIC 9(3).
               05  EMPEADOS-TELEFONO PIC X(9).
               05  EMPEADOS-DIRECCION PIC X(35).